---
kind: type
id: T:Autodesk.Revit.DB.FabricationDimensionUnitType
source: html/4e5471e0-b4d5-4b55-afa8-66edda1c31b0.htm
---
# Autodesk.Revit.DB.FabricationDimensionUnitType

Fabrication dimension unit type.

## Syntax (C#)
```csharp
public enum FabricationDimensionUnitType
```